In [1]:
#1

In [2]:
import pandas as pd
import numpy as np

import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication

from getpass import getpass  # To get the password without showing the input

In [3]:
password = getpass()

········

In [4]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [5]:
type(engine)

sqlalchemy.engine.base.Engine

In [6]:
data = pd.read_sql_query('SELECT * FROM sakila.rental ', engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [7]:
#2

In [8]:
def rentals_month(en, m, y):
    query = 'SELECT * FROM sakila.rental WHERE MONTH(rental_date) =' + str(m) + ' AND YEAR(rental_date) =(' + str(y) + ')'
    print(query)
    data = pd.read_sql_query(query, engine)
    return data

rentals_month('mysql+pymysql://root:'+ password + '@localhost/sakila', 5, 2005)

SELECT * FROM sakila.rental WHERE MONTH(rental_date) =5 AND YEAR(rental_date) =(2005)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53

In [9]:
#3. Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a 
#new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

In [10]:
def rental_count_month(df, m, y):
    column_title = "rentals_" + str(m) + "_" + str(y)
    grouped = df.groupby('customer_id')
    rental_counts = grouped['rental_id'].count()
    data_df = rental_counts.to_frame(name=column_title)
    return data_df

d2 = rental_count_month(data, 3, 2005)
d2

             rentals_3_2005
customer_id
1                        32
2                        27
3                        26
4                        22
5                        38
...                     ...
595                      30
596                      28
597                      25
598                      22
599                      19

[599 rows x 1 columns]

In [11]:
June = rentals_month('mysql+pymysql://root:'+ password + '@localhost/sakila', 6, 2005)

SELECT * FROM sakila.rental WHERE MONTH(rental_date) =6 AND YEAR(rental_date) =(2005)

In [12]:
June_grouped = rental_count_month(June, 6, 2005)
June_grouped

             rentals_6_2005
customer_id
1                         7
2                         1
3                         4
4                         6
5                         5
...                     ...
595                       2
596                       2
597                       3
598                       1
599                       4

[590 rows x 1 columns]

In [13]:
July = rentals_month('mysql+pymysql://root:'+ password + '@localhost/sakila', 7, 2005)

SELECT * FROM sakila.rental WHERE MONTH(rental_date) =7 AND YEAR(rental_date) =(2005)

In [14]:
July_grouped = rental_count_month(June, 7, 2005)
July_grouped

             rentals_7_2005
customer_id
1                         7
2                         1
3                         4
4                         6
5                         5
...                     ...
595                       2
596                       2
597                       3
598                       1
599                       4

[590 rows x 1 columns]

In [15]:
#4. # Create a Python function called compare_rentals that takes two DataFrames as input containing the number of 
# rentals made by each customer in different months and years.

# The function should return a combined DataFrame with a new 'difference' column, 
# which is the difference between the number of rentals in the two months.

In [31]:
def compare_rentals(df1, df2):
    df1_grouped = df1.groupby('customer_id')
    df1_rental_counts = df1_grouped['rental_id'].count()
    df2_grouped = df2.groupby('customer_id')
    df2_rental_counts = df2_grouped['rental_id'].count()
    data_df = pd.DataFrame({
    'Rental per month 1': df1_rental_counts,
    'Rental per month 2': df2_rental_counts,
    'Difference': df1_rental_counts - df2_rental_counts})
    print(data_df)


may= rentals_month('mysql+pymysql://root:'+ password + '@localhost/sakila', 5, 2005)
june = rentals_month('mysql+pymysql://root:'+ password + '@localhost/sakila', 6, 2005)

compare_rentals(may, june)

may.head()

SELECT * FROM sakila.rental WHERE MONTH(rental_date) =5 AND YEAR(rental_date) =(2005)
SELECT * FROM sakila.rental WHERE MONTH(rental_date) =6 AND YEAR(rental_date) =(2005)
             Rental per month 1  Rental per month 2  Difference
customer_id
1                           2.0                 7.0        -5.0
2                           1.0                 1.0         0.0
3                           2.0                 4.0        -2.0
4                           NaN                 6.0         NaN
5                           3.0                 5.0        -2.0
...                         ...                 ...         ...
595                         1.0                 2.0        -1.0
596                         6.0                 2.0         4.0
597                         2.0                 3.0        -1.0
598                         NaN                 1.0         NaN
599                         1.0                 4.0        -3.0

[598 rows x 3 columns]

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [32]:
import pandas as pd

def compare_rentals(df1, df2):
    df1_grouped = df1.groupby('customer_id')
    df1_rental_counts = df1_grouped['rental_id'].count()
    df2_grouped = df2.groupby('customer_id')
    df2_rental_counts = df2_grouped['rental_id'].count()

    data_df = pd.DataFrame({
        'Rental per month 1': df1_rental_counts,
        'Rental per month 2': df2_rental_counts,
    })

    # Fill NaN values in the first two columns with 0
    data_df[['Rental per month 1', 'Rental per month 2']] = data_df[['Rental per month 1', 'Rental per month 2']].fillna(0)

    # Calculate the 'Difference' column
    data_df['Difference'] = data_df['Rental per month 1'] - data_df['Rental per month 2']

    print(data_df)

# Assuming the rest of your code remains the same
# Call the compare_rentals function with your 'may' and 'june' DataFrames
# (assuming the 'rentals_month' function works as expected)
compare_rentals(may, june)

             Rental per month 1  Rental per month 2  Difference
customer_id
1                           2.0                 7.0        -5.0
2                           1.0                 1.0         0.0
3                           2.0                 4.0        -2.0
4                           0.0                 6.0        -6.0
5                           3.0                 5.0        -2.0
...                         ...                 ...         ...
595                         1.0                 2.0        -1.0
596                         6.0                 2.0         4.0
597                         2.0                 3.0        -1.0
598                         0.0                 1.0        -1.0
599                         1.0                 4.0        -3.0

[598 rows x 3 columns]